
/**
 * TODO 
            * 1. 1.1 * 3 = 3.300000000 => 소숫점 뒤, 맨 뒤가 0 이면 자르기 
            * 1-1. = 누를 때 delete 0한거 currentNumber.value -> expression에 들어갈 땐 적용 안됨 
            * 2. 98 + =  을 눌렀을 때 98 + 98 = 으로 
            * 3. 1. =     => 언디파인  
            * 3-1. 3. = 했을 때 current에 .없애주기 
            * 4. 3. +     => .뒤에 숫자 없으면 . 지워주기 
            * 5. = 계산 후, 숫자 누르면 새 계산 시작 
 * 6. 소숫점 자리 제한 -> 반올림
 * 6-1. 2.0120 + 32.023 -> 34.035000000000004 부동소수점 
            * 7. 1=, 2=, 3=  
 * 8. % 여러번 눌러서 e- 나오는것과 값이 커져서 e가 나오는것  -> 어느정도부터는 값 더해도 제자리
            * 9. 세자리마다 , (4,7,10,13,16 -> 4부터 3씩 ,)
            * 10. 입력 글자 수 제한 (소수점있으면 17, 없으면 16)
            * 10. 식이 여러개일 때, = 누르면 1개식으로 변경돼서 결과 나옴 
        * 10-1. 3298 + 324 + 3658 +  =   이렇게 입력 할 때 -> 마지막 second 값은 이전 result 
 */ 





